<h1>เกี่ยวกับบาร์โค้ด:</h1>
<br><br>

คำแนะนำการใช้งาน:
<ul>
  <li><a href="#limi">ข้อจำกัดของโปรแกรม OpenBiblio ในของบาร์โค้ด </a></li>
  <li><a href="#memb">รหัสบาร์โค้ดสมาชิก</a></li>
  <li><a href="#copy">รหัสบาร์โค้ดรายการตัวเล่ม</a></li>
  <li><a href="#scan">การใช้เครื่องอ่านบาร์โค้ด</a></li>
  <li><a href="#labe">การพิมพ์บาร์โค้ดและพิมพ์เลขเรียกหนังสือ</a></li>
  <li><a href="#link">ลิงค์เว็บไซต์เกี่ยวกับบาร์โค้ด</a></li>
</ul>
<br><br>


<a name="limi">ข้อจำกัดของโปรแกรม OpenBiblio ในของบาร์โค้ด</a>:
<ul>
  <li>การใส่รหัสบาร์โค้ดต้องใส่ตัวอักษรและหรือตัวเลขเท่านั้น เช่น a-zA-Z0-9<br>
แม้ว่าบาร์โค้ดสามารถเข้ารหัสตัวอักษรพิเศษได้ แต่โปรแกรม OpenBiblio ไม่อนุญาตให้ใช้ตัวอักษรพิเศษ เช่น - $ % SPACE . / + 
  </li>
  <li>หลังจากบันทึกบาร์โค้ดแล้ว ตัวอักษรจะถูกเปลี่ยนให้เป็นอักษรพิมพ์เล็ก.</li>
  <li>จำกัดความยาวสูงสุดของรหัสบาร์โค้ด 20 ตัวอักษร .</li>
</ul>
หากเลือกใช้ตัวเลขเป็นรหัสบาร์โค้ด โปรดระวังเรื่องข้อจำกัด ต้องแน่ใจว่า สัญลักษณ์บาร์โค้ดที่คุณจะใช้พิมพ์นั้นไม่ขัดแย้งกับข้อจำกัด ยกตัวอย่างเช่น Code 39 (3 of 9, not the extended version) เข้ารหัสตัวอักษรพิมพ์ใหญ่ (Uppercase) เท่านั้น 
<br><br><br>
  
<a name="memb">รหัสบาร์โค้ดสมาชิก</a>:
<br>
 เพื่อให้การทำงานยืม-คืน มีประสิทธิภาพโดยเฉพาะการใช้เครื่องอ่านบาร์โค้ด  ควรใช้รหัสบาร์โค้ดที่เป็นตัวเลขสำหรับรหัสสมาชิก
<br>
ถ้าเครื่องอ่านบาร์โค้ดไม่ทำงานหรือไม่ใช้เครื่องอ่านบาร์โค้ดสามารถพิมพ์รหัสบาร์โค้ดหรือชื่อสมาชิกแทนได้
<br><br><br>

<a name="copy">รหัสบาร์โค้ดรายการตัวเล่ม</a>:
<br>
การพิมพ์รหัสบาร์โค้ด และรายการบรรณานุกรมรวมทั้งการพิมพ์เลขเรียกหนังสือ (พิมพ์สัน) ตองแน่ใจว่ารายการตรงกัน
<a href="#limi">ข้อจำกัดการใช้บาร์โค้ดโปรแกรม Openbiblio</a>.
<br>
ถ้าห้องสมุดไม่เคยกำหนดรหัสบาร์โค้ดตัวเล่ม คุณจะต้องตัดสินใจสำหรับการกำหนดรหัสบาร์โค้ดให้เหมาะสมกับห้องสมุดของคุณ
<a href="../shared/help.php?page=biblioCopyEdit#auto">การสร้างรหัสบาร์โค้ดโดยอัตโนมัติ</a>.
มีความรวดเร็วในการสร้างรหัสบาร์โค้ดเพิ่มขึ้นและง่ายสำหรับการสร้าง
<br><br><br>
<a name="scan">การใช้เครื่องอ่านบาร์โค้ด :</a>
<br>
โปรแกรม OpenBiblio สามารถรองรับเครื่องอ่านบาร์โค้ดที่ทำหน้าที่คล้ายคีย์บอร์ด รวมถึงเครื่องอ่านบาร์โค้ดแบบ USB รวมทั้งเครื่องอ่านบาร์โค้ดที่ต่อระหว่างเครื่องคอมพิวเตอร์และคีย์บอร์ด
เครื่องอ่านบาร์โค้ดส่วนใหญ่ในปัจจุบันสามารถตั้งโปรแกรมเพื่อให้อ่านรหัสบาร์โค้ดและต่อด้วยการชี้ตำแหน่ง (cursor) ลงในตำแหน่งแรกของบรรทัดถัดลงมา (ซึ่งเหมือนกับการกดปุ่ม ENTER บนคีย์บอร์ด) ทุกครั้งที่อ่านรหัสบาร์โค้ด โปรแกรม OpenBiblio จะสามารถประมวลผลคำสั่งทันทีที่เครื่องอ่านรหัสบาร์โค้ด 

<br><br><br>

<a name="labe">การพิมพ์บาร์โค้ดและพิมพ์เลขเรียกหนังสือ</a></li>
การพิมพ์บาร์โค้ดและพิมพ์เลขเรียกหนังสือ</a> การยืม-คืนด้วยบาร์โค้ดที่มีประสิทธิภาพ, จำเป็นต้องใช้เครื่องอ่านบาร์โค้ดที่มีประสิทธิภาพด้วย.
</ul>
<br>

<a name="link">ลิงค์เว็บไซต์เกี่ยวกับบาร์โค้ด</a>
<br>
<a href="javascript:popSecondaryLarge('http://en.wikipedia.org/wiki/Barcode')">Wikipedia: barcode</a>
<br>
<a href="javascript:popSecondaryLarge('http://www.barcodesymbols.com/')">http://www.barcodesymbols.com/</a>
<br>
<a href="javascript:popSecondaryLarge('http://www.barcodefaq.com/')">http://www.barcodefaq.com/</a>
