<h1>หน้าค้นหาสมาชิก (ยืม-คืน):</h1>
<br><br>

คำแนะนำการใช้งาน:
<ul>
  <li><a href="#sec1"><font class="error">ช่วยจัดการระบบยังอยู่ระหว่างดำเนินการ.</font></a></li>
  <li><a href="#barc">การยืม/คืนที่มีและไม่มีบาร์โค้ด</a></li>
  <li><a href="#late">การคำนวณค่าปรับ (ไม่มีการแจ้งเตือน) </a></li>
</ul>
<br><br>

<a name="barc">
การคำนวณค่าปรับ (ไม่มีการแจ้งเตือน) </a>:
<br>
แบบฟอร์มการยืม/คืนของโปรแกรม OpenBiblio ถูกออกแบบมาเพื่อสนับสนุนการยืม/คืนที่มีประสิทธิภาพเมื่อใช้เครื่องอ่านบาร์โค้ด และ 
<a href="../shared/help.php?page=barcodes">บาร์โค้ด</a> 
ถูกพิมพ์บนบัตรสมาชิกและ และพิมพ์สัน (เลขเรียกหนังสือ).
<br>
ความเป็นไปได้ที่จะยืม/คืนเมื่อโปรแกรมไม่มีบาร์โค้ดนั้น สามารถค้นหาสมาชิกโดยใช้ชื่อนามสกุลและ จากการสืบค้น OPAC 
<a href="../shared/help.php?page=opacLookup">ค้นหารหัสบาร์โค้ด</a> 
เพื่อนำบาร์โค้ดขึ้นมาแสดงสำหรับยืม คืน หรือ จอง .
<br><br><br>

<a name="late">
การคำนวณค่าปรับ (ไม่มีการแจ้งเตือน): </a>:
<br>
โปรแกรม OpenBiblio ไม่มีการแจ้งบรรณารักษ์เมื่อสมาชิกยืมเกินกำหนดระยะเวลาและไม่มีการคำนวณค่าปรับ ทั้งนี้ขึ้นอยู่กับกฎระเบียบของห้องสมุดและการกำหนดโดยบรรณารักษ์ และเพื่อไม่ให้เกิดปัญหาการคำนวณค่าปรับที่ไม่เป็นธรรม ให้ไปที่หน้า ประเภทสถานที่จัดเก็บ และกำหนดค่าปรับ ให้เป็น 0 (ศูนย์) .